УТ_для_edt/src/DataProcessors/смартКвалификацииИнженеровСЦ/смартКвалификацииИнженеровСЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>смартКвалификацииИнженеровСЦ</name>
  <comment>#Б-2770 смарт: Лопато 26.03.2025 //Создание механизма учета квалификации инженеров СЦ.</comment>
</mdclass:DataProcessor>

УТ_для_edt/src/InformationRegisters/смартВидыКвалификацийИнженеровСЦ/смартВидыКвалификацийИнженеровСЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартВидыКвалификацийИнженеровСЦ</name>
  <comment>#Б-2770 смарт: Лопато 26.03.2025 //Создание механизма учета квалификации инженеров СЦ.</comment>
  <resources>
    <name>Запуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Ремонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗапускРучноеИзменение</name>
    <type>
      <types>EnumRef.смартРучнаяКорректировкаКвалификаций</types>
    </type>
  </resources>
  <resources>
    <name>РемонтРучноеИзменение</name>
    <type>
      <types>EnumRef.смартРучнаяКорректировкаКвалификаций</types>
    </type>
  </resources>
  <resources>
    <name>ЗапускРучноеИзменениеАвтор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>РемонтРучноеИзменениеАвтор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ЗапускДатаДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>РемонтДатаДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.смартОборудованиеКлиентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Инженер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/смартРучнаяКорректировкаКвалификаций/смартРучнаяКорректировкаКвалификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартРучнаяКорректировкаКвалификаций</name>
  <comment>#Б-2770 смарт: Лопато 26.03.2025 //Создание механизма учета квалификации инженеров СЦ.</comment>
  <enumValues>
    <name>Блокировка</name>
  </enumValues>
  <enumValues>
    <name>Активация</name>
  </enumValues>
  <enumValues>
    <name>Нет</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/DataProcessors/смартКвалификацииИнженеровСЦ/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаполнитьСоотвествиеКолонокПодразделений();
	
	УстановитьВидимостьДоступность();
	
	ЗаполнитьДанные();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КвалификацииИнженеровСЦПриАктивизацииСтроки(Элемент)
	
	ТекЭлемент = Элемент.ТекущийЭлемент;
	ТекДанные = Элементы.КвалификацииИнженеровСЦ.ТекущиеДанные;
	
	Если ТекЭлемент <> Неопределено Тогда
		ОтобразитьГруппуИЗменений(ТекЭлемент.Имя, ТекДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КвалификацииИнженеровСЦПриАктивизацииПоля(Элемент)

	ТекЭлемент = Элемент.ТекущийЭлемент;
	ТекДанные = Элементы.КвалификацииИнженеровСЦ.ТекущиеДанные;
	
	Если ТекЭлемент <> Неопределено Тогда
		ОтобразитьГруппуИЗменений(ТекЭлемент.Имя, ТекДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РучнаяАктивацияЗапускПриИзменении(Элемент)

	Если РучнаяАктивацияЗапуск Тогда
		
		РучнаяБлокировкаЗапуск = Ложь;
		РучнаяБлокировкаЗапускДоДаты = Неопределено;
		
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура РучнаяАктивацияРемонтПриИзменении(Элемент)

	Если РучнаяАктивацияРемонт Тогда
		
		РучнаяБлокировкаРемонт = Ложь;
		РучнаяБлокировкаРемонтДоДаты = Неопределено;
		
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура РучнаяБлокировкаЗапускПриИзменении(Элемент)

	Если РучнаяБлокировкаЗапуск Тогда
		
		РучнаяАктивацияЗапуск = Ложь;
		РучнаяАктивацияЗапускДоДаты = Неопределено;
		
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура РучнаяБлокировкаРемонтПриИзменении(Элемент)

	Если РучнаяБлокировкаРемонт Тогда
		
		РучнаяАктивацияРемонт = Ложь;
		РучнаяАктивацияРемонтДоДаты = Неопределено;
		
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура РучнаяАктивацияЗапускДоДатыПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(РучнаяАктивацияЗапускДоДаты) Тогда
		
		РучнаяАктивацияЗапуск = Истина;
		
		РучнаяАктивацияЗапускПриИзменении(Элемент);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура РучнаяАктивацияРемонтДоДатыПриИзменении(Элемент)

	Если ЗначениеЗаполнено(РучнаяАктивацияРемонтДоДаты) Тогда
		
		РучнаяАктивацияРемонт = Истина;
		
		РучнаяАктивацияРемонтПриИзменении(Элемент);
		
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура РучнаяБлокировкаЗапускДоДатыПриИзменении(Элемент)

	Если ЗначениеЗаполнено(РучнаяБлокировкаЗапускДоДаты) Тогда
		
		РучнаяБлокировкаЗапуск = Истина;
		
		РучнаяБлокировкаЗапускПриИзменении(Элемент);
		
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура РучнаяБлокировкаРемонтДоДатыПриИзменении(Элемент)

	Если ЗначениеЗаполнено(РучнаяБлокировкаРемонтДоДаты) Тогда
		
		РучнаяБлокировкаРемонт = Истина;
		
		РучнаяБлокировкаРемонтПриИзменении(Элемент);
		
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)

	ТекЭлемент = Элементы.КвалификацииИнженеровСЦ.ТекущийЭлемент;
	ТекОборудование = Элементы.КвалификацииИнженеровСЦ.ТекущиеДанные.Оборудование;
	
	Если ТекЭлемент <> Неопределено
		И ТекЭлемент.Имя <> "КвалификацииИнженеровСЦОборудование" Тогда
	
		СохранитьНаСервере();

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСоотвествиеКолонокПодразделений()
	
	СоответствиеКолонокПодразделений.Очистить();
	
	НовоеПодразделение = Справочники.СтруктураПредприятия.НайтиПоКоду("00-000012");
	СоответствиеКолонокПодразделений.Добавить(НовоеПодразделение, "ГоловнойОфисМосква");

	НовоеПодразделение = Справочники.СтруктураПредприятия.НайтиПоКоду("ЦБ-000002");
	СоответствиеКолонокПодразделений.Добавить(НовоеПодразделение, "Воронеж");

	НовоеПодразделение = Справочники.СтруктураПредприятия.НайтиПоКоду("00-000015");
	СоответствиеКолонокПодразделений.Добавить(НовоеПодразделение, "Екатеринбург");
	
	НовоеПодразделение = Справочники.СтруктураПредприятия.НайтиПоКоду("ЦБ-000022");
	СоответствиеКолонокПодразделений.Добавить(НовоеПодразделение, "Иваново");

	НовоеПодразделение = Справочники.СтруктураПредприятия.НайтиПоКоду("00-000009");
	СоответствиеКолонокПодразделений.Добавить(НовоеПодразделение, "Краснодар");

	НовоеПодразделение = Справочники.СтруктураПредприятия.НайтиПоКоду("00-000010");
	СоответствиеКолонокПодразделений.Добавить(НовоеПодразделение, "НабережныеЧелны");

	НовоеПодразделение = Справочники.СтруктураПредприятия.НайтиПоКоду("00-000016");
	СоответствиеКолонокПодразделений.Добавить(НовоеПодразделение, "Новосибирск");

	НовоеПодразделение = Справочники.СтруктураПредприятия.НайтиПоКоду("00-000008");
	СоответствиеКолонокПодразделений.Добавить(НовоеПодразделение, "СанктПетербург");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()

	ТекПользователь = Пользователи.АвторизованныйПользователь();
	
	Если НЕ Пользователи.РолиДоступны("смартСервисныйЦентрАдминистрирование") 
		И РольДоступна("смартРуководительCRM") Тогда
		
		ПодразделениеТекущегоПользователя = ТекПользователь.Подразделение;
		
		Для Каждого КолонкаПодразделение Из СоответствиеКолонокПодразделений Цикл

			Если КолонкаПодразделение.Значение <> ПодразделениеТекущегоПользователя Тогда
				Элементы[КолонкаПодразделение.Представление].Видимость = Ложь;
			КонецЕсли;	
			
		КонецЦикла;	
			
	КонецЕсли;	
	
	ПравоИзменения = УправлениеДоступом. ИзменениеРазрешено(
						 РегистрыСведений.смартВидыКвалификацийИнженеровСЦ.СоздатьНаборЗаписей(), ТекПользователь);
	
	Элементы.ГруппаБлокиИзменение.Доступность = ПравоИзменения; 
	Элементы.Сохранить.Доступность = ПравоИзменения; 
	
КонецПроцедуры
	
&НаСервере
Процедура ЗаполнитьДанные()

	//++ #Б-2922 смарт: Лопато 02.04.2025 //Доработка обработки "Квалификация инженеров".  
	КвалификацииИнженеровСЦ.Очистить();
	КвалификацииИнженеровСЦДанные.Очистить();
	КвалификацииИнженеровСЦПодвал.Очистить();

	СтрокаПодвал = КвалификацииИнженеровСЦПодвал.Добавить();
	//-- #Б-2922 смарт: Лопато 02.04.2025
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ссылка КАК ОборудованиеСсылка,
	|	РегистрКвалификации.Оборудование КАК Оборудование,
	|	РегистрКвалификации.Подразделение КАК Подразделение,
	|	РегистрКвалификации.Инженер КАК Инженер,
	|	РегистрКвалификации.Запуск КАК Запуск,
	|	РегистрКвалификации.Ремонт КАК Ремонт,
	|	РегистрКвалификации.ЗапускРучноеИзменение КАК ЗапускРучноеИзменение,
	|	РегистрКвалификации.РемонтРучноеИзменение КАК РемонтРучноеИзменение,
	|	РегистрКвалификации.ЗапускРучноеИзменениеАвтор КАК ЗапускРучноеИзменениеАвтор,
	|	РегистрКвалификации.РемонтРучноеИзменениеАвтор КАК РемонтРучноеИзменениеАвтор,
	|	РегистрКвалификации.ЗапускДатаДо КАК ЗапускДатаДо,
	|	РегистрКвалификации.РемонтДатаДо КАК РемонтДатаДо
	|ИЗ
	|	Справочник.смартОборудованиеКлиентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.смартВидыКвалификацийИнженеровСЦ КАК РегистрКвалификации
	|		ПО Ссылка = РегистрКвалификации.Оборудование
	|ГДЕ
	|	УчитыватьКвалификациюИнженеров
	|	И НЕ ПометкаУдаления
	|	И НЕ ЭтоГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|
	|ИТОГИ ПО
	|	Ссылка,
	|	Подразделение
	|
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Результат = Запрос.Выполнить();
	
	ВыборкаОборудование = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаОборудование.Следующий() Цикл
	
		НоваяСтрокаКвалификации = КвалификацииИнженеровСЦ.Добавить();
	
	    НоваяСтрокаКвалификации.Оборудование = ВыборкаОборудование.ОборудованиеСсылка;
		
		ВыборкаПодразделение = ВыборкаОборудование.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		Пока ВыборкаПодразделение.Следующий() Цикл
		
			Если ЗначениеЗаполнено(ВыборкаПодразделение.Подразделение) Тогда
			
				НайденныйЭлемент = СоответствиеКолонокПодразделений.НайтиПоЗначению(ВыборкаПодразделение.Подразделение);
				
				Если НайденныйЭлемент <> Неопределено Тогда
					
					НаименованиеКолонкиПодразделения = НайденныйЭлемент.Представление;
					
					Выборка = ВыборкаПодразделение.Выбрать();

					Пока Выборка.Следующий() Цикл

						ПоместитьЗначениеВКолонку(Выборка, НоваяСтрокаКвалификации, НаименованиеКолонкиПодразделения, "Запуск");
						ПоместитьЗначениеВКолонку(Выборка, НоваяСтрокаКвалификации, НаименованиеКолонкиПодразделения, "Ремонт");
						
						ЗаполнитьЗначенияСвойств(КвалификацииИнженеровСЦДанные.Добавить(), Выборка);

						//++ #Б-2922 смарт: Лопато 02.04.2025 //Доработка обработки "Квалификация инженеров".
						КвалификацииИнженеровСЦПодвал[0].Оборудование = КвалификацииИнженеровСЦПодвал[0].Оборудование + 1;
						//-- #Б-2922 смарт: Лопато 02.04.2025
						
					КонецЦикла;
					
				КонецЕсли;	
			
			КонецЕсли;	

		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры	

&НаСервере
Процедура ПоместитьЗначениеВКолонку(Выборка, НоваяСтрокаКвалификации, НаименованиеКолонкиПодразделения, ТипКолонки)

	НаименованиеКолонки = НаименованиеКолонкиПодразделения + ТипКолонки;
	
	Если Выборка[ТипКолонки] Тогда
		
		Если Выборка[ТипКолонки + "РучноеИзменение"] = Перечисления.смартРучнаяКорректировкаКвалификаций.Активация Тогда
			НоваяСтрокаКвалификации[НаименованиеКолонки] = "+";
			//++ #Б-2922 смарт: Лопато 02.04.2025 //Доработка обработки "Квалификация инженеров".
			КвалификацииИнженеровСЦПодвал[0][НаименованиеКолонки] = КвалификацииИнженеровСЦПодвал[0][НаименованиеКолонки] + 1;
			//-- #Б-2922 смарт: Лопато 02.04.2025
		ИначеЕсли Выборка[ТипКолонки + "РучноеИзменение"] = Перечисления.смартРучнаяКорректировкаКвалификаций.Блокировка Тогда
			НоваяСтрокаКвалификации[НаименованиеКолонки] = "-";
		КонецЕсли;	

	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьГруппуИЗменений(ТекущийЭлементИмя, ТекДанные)

	Подразделение = Неопределено;
	Оборудование = Неопределено;
	
	ОчиститьРучнаяАктивация("Запуск");
	ОчиститьРучнаяАктивация("Ремонт");
	
	ОчиститьРучнаяБлокировка("Запуск");
	ОчиститьРучнаяБлокировка("Ремонт");
	
	Если СтрНайти(ТекущийЭлементИмя, "Запуск") <> 0 
		ИЛИ СтрНайти(ТекущийЭлементИмя, "Ремонт") <> 0 Тогда
		
		КвалификацииИнженеровЗаполнитьДанныеНаСервере(ТекущийЭлементИмя, ТекДанные.Оборудование);

	КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Процедура КвалификацииИнженеровЗаполнитьДанныеНаСервере(ТекущийЭлементИмя, ТекОборудование)
	
	ТекПодразделение = Неопределено;

	Для Каждого ЭлементПодразделение Из СоответствиеКолонокПодразделений Цикл
		
		Если СтрНайти(ТекущийЭлементИмя, ЭлементПодразделение.Представление) <> 0 Тогда
			ТекПодразделение = ЭлементПодразделение.Значение;
			Прервать;
		КонецЕсли;	
		
	КонецЦикла;	

	Если ЗначениеЗаполнено(ТекПодразделение)
		И ЗначениеЗаполнено(ТекОборудование) Тогда
		
		Подразделение = ТекПодразделение;
		Оборудование = ТекОборудование;
		
		СтруктураОтбора = Новый Структура("Подразделение, Оборудование", 
										   ТекПодразделение, ТекОборудование);
										   
		СтрокиДанных = КвалификацииИнженеровСЦДанные.НайтиСтроки(СтруктураОтбора);
		
		Если СтрокиДанных.Количество() > 0 Тогда
			
			ЗаполнитьБлокРучноеИзменение(СтрокиДанных[0], "Запуск");
			ЗаполнитьБлокРучноеИзменение(СтрокиДанных[0], "Ремонт");

		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьБлокРучноеИзменение(СтруктураТекущихДанных, ТипКолонки)

	Если СтруктураТекущихДанных[ТипКолонки + "РучноеИзменение"] = Перечисления.смартРучнаяКорректировкаКвалификаций.Активация Тогда
		
		ЭтотОбъект["РучнаяАктивация" + ТипКолонки] 			  = СтруктураТекущихДанных[ТипКолонки];	
		ЭтотОбъект["РучнаяАктивация" + ТипКолонки + "ДоДаты"] = СтруктураТекущихДанных[ТипКолонки + "ДатаДо"];
		ЭтотОбъект["РучнаяАктивацияКтоСделал" + ТипКолонки]   = СтруктураТекущихДанных[ТипКолонки + "РучноеИзменениеАвтор"];

	ИначеЕсли СтруктураТекущихДанных[ТипКолонки + "РучноеИзменение"] = Перечисления.смартРучнаяКорректировкаКвалификаций.Блокировка Тогда
		
		ЭтотОбъект["РучнаяБлокировка" + ТипКолонки] 		   = СтруктураТекущихДанных[ТипКолонки];	
		ЭтотОбъект["РучнаяБлокировка" + ТипКолонки + "ДоДаты"] = СтруктураТекущихДанных[ТипКолонки + "ДатаДо"];
		ЭтотОбъект["РучнаяБлокировкаКтоСделал" + ТипКолонки]   = СтруктураТекущихДанных[ТипКолонки + "РучноеИзменениеАвтор"];
		
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРучнаяАктивация(ТипКолонки)

	ЭтотОбъект["РучнаяАктивация" + ТипКолонки] 			  = Неопределено;	
	ЭтотОбъект["РучнаяАктивация" + ТипКолонки + "ДоДаты"] = Неопределено;
	ЭтотОбъект["РучнаяАктивацияКтоСделал" + ТипКолонки]   = Неопределено;

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРучнаяБлокировка(ТипКолонки)

	ЭтотОбъект["РучнаяБлокировка" + ТипКолонки] 		   = Неопределено;	
	ЭтотОбъект["РучнаяБлокировка" + ТипКолонки + "ДоДаты"] = Неопределено;
	ЭтотОбъект["РучнаяБлокировкаКтоСделал" + ТипКолонки]   = Неопределено;

КонецПроцедуры

&НаСервере
Процедура УстановитьТекущуюСтроку(Оборудование)

	ИдСтроки = 0;
	
	Для Каждого Стр Из КвалификацииИнженеровСЦ Цикл
		
		Если Стр.Оборудование = Оборудование Тогда
			ИдСтроки = Стр.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;	

	КонецЦикла;
	
	Если ЗначениеЗаполнено(ИдСтроки) Тогда	
		Элементы.КвалификацииИнженеровСЦ.ТекущаяСтрока = ИдСтроки;
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	
	Если НЕ (ЗначениеЗаполнено(Подразделение)
			 И ЗначениеЗаполнено(Оборудование)) Тогда
			 
		Возврат;
			 
	КонецЕсли;	
	
	ТекПользователь = Пользователи.АвторизованныйПользователь();
	
	НаборЗаписейКвалификации = РегистрыСведений.смартВидыКвалификацийИнженеровСЦ.СоздатьНаборЗаписей();
	
	НаборЗаписейКвалификации.Отбор.Подразделение.Установить(Подразделение);
	НаборЗаписейКвалификации.Отбор.Оборудование.Установить(Оборудование);
	
	НоваяЗаписьКвалификации = НаборЗаписейКвалификации.Добавить();
	
	НоваяЗаписьКвалификации.Подразделение = Подразделение;
	НоваяЗаписьКвалификации.Оборудование  = Оборудование;
	НоваяЗаписьКвалификации.Инженер 	  = Неопределено;
	
	Если РучнаяАктивацияЗапуск Тогда

		НоваяЗаписьКвалификации.Запуск 						= РучнаяАктивацияЗапуск;
		НоваяЗаписьКвалификации.ЗапускРучноеИзменениеАвтор 	= ТекПользователь;
		НоваяЗаписьКвалификации.ЗапускДатаДо 				= РучнаяАктивацияЗапускДоДаты;
		НоваяЗаписьКвалификации.ЗапускРучноеИзменение 		= Перечисления.смартРучнаяКорректировкаКвалификаций.Активация;
		
	ИначеЕсли РучнаяБлокировкаЗапуск Тогда
		
		НоваяЗаписьКвалификации.Запуск 						= РучнаяБлокировкаЗапуск;
		НоваяЗаписьКвалификации.ЗапускРучноеИзменениеАвтор 	= ТекПользователь;
		НоваяЗаписьКвалификации.ЗапускДатаДо 				= РучнаяБлокировкаЗапускДоДаты;
		НоваяЗаписьКвалификации.ЗапускРучноеИзменение 		= Перечисления.смартРучнаяКорректировкаКвалификаций.Блокировка;
		
	КонецЕсли;	
	
	Если РучнаяАктивацияРемонт Тогда

		НоваяЗаписьКвалификации.Ремонт 						= РучнаяАктивацияРемонт;
		НоваяЗаписьКвалификации.РемонтРучноеИзменениеАвтор 	= ТекПользователь;
		НоваяЗаписьКвалификации.РемонтДатаДо 				= РучнаяАктивацияРемонтДоДаты;
		НоваяЗаписьКвалификации.РемонтРучноеИзменение 		= Перечисления.смартРучнаяКорректировкаКвалификаций.Активация;
		
	ИначеЕсли РучнаяБлокировкаРемонт Тогда
		
		НоваяЗаписьКвалификации.Ремонт 						= РучнаяБлокировкаРемонт;
		НоваяЗаписьКвалификации.РемонтРучноеИзменениеАвтор 	= ТекПользователь;
		НоваяЗаписьКвалификации.РемонтДатаДо 				= РучнаяБлокировкаРемонтДоДаты;
		НоваяЗаписьКвалификации.РемонтРучноеИзменение 		= Перечисления.смартРучнаяКорректировкаКвалификаций.Блокировка;
		
	КонецЕсли;	
	
	Попытка
		НаборЗаписейКвалификации.Записать();
	Исключение
		ОбщегоНазначения.СообщитьПользователю("Не удалось записать данные!");
	КонецПопытки;
	
	ЗаполнитьДанные();

	УстановитьТекущуюСтроку(Оборудование);
	
КонецПроцедуры

#КонецОбласти
